InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
#define MPU_RASR_SRD6_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR_SRD6_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR_SRD6_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_SRD7_MASK    ((uint32_t) 0x00008000UL)
#define MPU_RASR_R_SRD7_BIT    (15UL)
#define MPU_RASR_R_SRD7_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_SRD7_DIS    ((uint32_t) 0x00008000UL)

#define MPU_RASR_SRD7_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR_SRD7_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR_SRD7_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_B_MASK    ((uint32_t) 0x00010000UL)
#define MPU_RASR_R_B_BIT    (16UL)
#define MPU_RASR_R_B_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_B_ENA    ((uint32_t) 0x00010000UL)

#define MPU_RASR_B_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR_B_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_B_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_C_MASK    ((uint32_t) 0x00020000UL)
#define MPU_RASR_R_C_BIT    (17UL)
#define MPU_RASR_R_C_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_C_ENA    ((uint32_t) 0x00020000UL)

#define MPU_RASR_C_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR_C_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_C_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_S_MASK    ((uint32_t) 0x00040000UL)
#define MPU_RASR_R_S_BIT    (18UL)
#define MPU_RASR_R_S_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_S_ENA    ((uint32_t) 0x00040000UL)

#define MPU_RASR_S_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR_S_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_S_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_TEX_MASK    ((uint32_t) 0x00380000UL)
#define MPU_RASR_R_TEX_BIT    (19UL)
#define MPU_RASR_R_TEX_NC    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_TEX_WB_WRA    ((uint32_t) 0x00080000UL)
#define MPU_RASR_R_TEX_WT_NWA    ((uint32_t) 0x00100000UL)
#define MPU_RASR_R_TEX_WB_NWA    ((uint32_t) 0x00180000UL)

#define MPU_RASR_TEX_MASK    ((uint32_t) 0x00000007UL)
#define MPU_RASR_TEX_NC    ((uint32_t) 0x00000000UL)
#define MPU_RASR_TEX_WB_WRA    ((uint32_t) 0x00000001UL)
#define MPU_RASR_TEX_WT_NWA    ((uint32_t) 0x00000002UL)
#define MPU_RASR_TEX_WB_NWA    ((uint32_t) 0x00000003UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_AP_MASK    ((uint32_t) 0x07000000UL)
#define MPU_RASR_R_AP_BIT    (24UL)
#define MPU_RASR_R_AP_NANA    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_AP_RWNA    ((uint32_t) 0x01000000UL)
#define MPU_RASR_R_AP_RWRO    ((uint32_t) 0x02000000UL)
#define MPU_RASR_R_AP_RWRW    ((uint32_t) 0x03000000UL)
#define MPU_RASR_R_AP_RONA    ((uint32_t) 0x05000000UL)
#define MPU_RASR_R_AP_RORO    ((uint32_t) 0x06000000UL)

#define MPU_RASR_AP_MASK    ((uint32_t) 0x00000007UL)
#define MPU_RASR_AP_NANA    ((uint32_t) 0x00000000UL)
#define MPU_RASR_AP_RWNA    ((uint32_t) 0x00000001UL)
#define MPU_RASR_AP_RWRO    ((uint32_t) 0x00000002UL)
#define MPU_RASR_AP_RWRW    ((uint32_t) 0x00000003UL)
#define MPU_RASR_AP_RONA    ((uint32_t) 0x00000005UL)
#define MPU_RASR_AP_RORO    ((uint32_t) 0x00000006UL)
/*--------*/

/*--------*/
#define MPU_RASR_R_XN_MASK    ((uint32_t) 0x10000000UL)
#define MPU_RASR_R_XN_BIT    (28UL)
#define MPU_RASR_R_XN_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_R_XN_ENA    ((uint32_t) 0x10000000UL)

#define MPU_RASR_XN_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR_XN_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR_XN_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/**********************************************************************************************
**************************************6 RBAR1 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RBAR1_R_REGION_MASK    ((uint32_t) 0x0000000FUL)
#define MPU_RBAR1_R_REGION_BIT    (0UL)
#define MPU_RBAR1_R_REGION_REG0    ((uint32_t) 0x00000000UL)
#define MPU_RBAR1_R_REGION_REG1    ((uint32_t) 0x00000001UL)
#define MPU_RBAR1_R_REGION_REG2    ((uint32_t) 0x00000002UL)
#define MPU_RBAR1_R_REGION_REG3    ((uint32_t) 0x00000003UL)
#define MPU_RBAR1_R_REGION_REG4    ((uint32_t) 0x00000004UL)
#define MPU_RBAR1_R_REGION_REG5    ((uint32_t) 0x00000005UL)
#define MPU_RBAR1_R_REGION_REG6    ((uint32_t) 0x00000006UL)
#define MPU_RBAR1_R_REGION_REG7    ((uint32_t) 0x00000007UL)
#define MPU_RBAR1_R_REGION_REG8    ((uint32_t) 0x00000008UL)
#define MPU_RBAR1_R_REGION_REG9    ((uint32_t) 0x00000009UL)
#define MPU_RBAR1_R_REGION_REG10    ((uint32_t) 0x0000000AUL)
#define MPU_RBAR1_R_REGION_REG11    ((uint32_t) 0x0000000BUL)
#define MPU_RBAR1_R_REGION_REG12    ((uint32_t) 0x0000000CUL)
#define MPU_RBAR1_R_REGION_REG13    ((uint32_t) 0x0000000DUL)
#define MPU_RBAR1_R_REGION_REG14    ((uint32_t) 0x0000000EUL)
#define MPU_RBAR1_R_REGION_REG15    ((uint32_t) 0x0000000FUL)

#define MPU_RBAR1_REGION_MASK    ((uint32_t) 0x0000000FUL)
#define MPU_RBAR1_REGION_REG0    ((uint32_t) 0x00000000UL)
#define MPU_RBAR1_REGION_REG1    ((uint32_t) 0x00000001UL)
#define MPU_RBAR1_REGION_REG2    ((uint32_t) 0x00000002UL)
#define MPU_RBAR1_REGION_REG3    ((uint32_t) 0x00000003UL)
#define MPU_RBAR1_REGION_REG4    ((uint32_t) 0x00000004UL)
#define MPU_RBAR1_REGION_REG5    ((uint32_t) 0x00000005UL)
#define MPU_RBAR1_REGION_REG6    ((uint32_t) 0x00000006UL)
#define MPU_RBAR1_REGION_REG7    ((uint32_t) 0x00000007UL)
#define MPU_RBAR1_REGION_REG8    ((uint32_t) 0x00000008UL)
#define MPU_RBAR1_REGION_REG9    ((uint32_t) 0x00000009UL)
#define MPU_RBAR1_REGION_REG10    ((uint32_t) 0x0000000AUL)
#define MPU_RBAR1_REGION_REG11    ((uint32_t) 0x0000000BUL)
#define MPU_RBAR1_REGION_REG12    ((uint32_t) 0x0000000CUL)
#define MPU_RBAR1_REGION_REG13    ((uint32_t) 0x0000000DUL)
#define MPU_RBAR1_REGION_REG14    ((uint32_t) 0x0000000EUL)
#define MPU_RBAR1_REGION_REG15    ((uint32_t) 0x0000000FUL)
/*--------*/

/*--------*/
#define MPU_RBAR1_R_VALID_MASK    ((uint32_t) 0x00000010UL)
#define MPU_RBAR1_R_VALID_BIT    (4UL)
#define MPU_RBAR1_R_VALID_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RBAR1_R_VALID_ENA    ((uint32_t) 0x00000010UL)

#define MPU_RBAR1_VALID_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RBAR1_VALID_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RBAR1_VALID_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RBAR1_R_ADDR_MASK    ((uint32_t) 0xFFFFFFE0UL)
#define MPU_RBAR1_R_ADDR_BIT    (5UL)

#define MPU_RBAR1_ADDR_MASK    ((uint32_t) 0x01FFFFFFUL)
/*--------*/

/**********************************************************************************************
**************************************7 RASR1 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RASR1_R_ENABLE_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_R_ENABLE_BIT    (0UL)
#define MPU_RASR1_R_ENABLE_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_ENABLE_ENA    ((uint32_t) 0x00000001UL)

#define MPU_RASR1_ENABLE_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_ENABLE_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_ENABLE_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SIZE_MASK    ((uint32_t) 0x0000003EUL)
#define MPU_RASR1_R_SIZE_BIT    (1UL)
#define MPU_RASR1_R_SIZE_32B    ((uint32_t) 0x00000008UL)
#define MPU_RASR1_R_SIZE_1KB    ((uint32_t) 0x00000012UL)
#define MPU_RASR1_R_SIZE_1MB    ((uint32_t) 0x00000026UL)
#define MPU_RASR1_R_SIZE_1GB    ((uint32_t) 0x0000003AUL)
#define MPU_RASR1_R_SIZE_4GB    ((uint32_t) 0x0000003EUL)

#define MPU_RASR1_SIZE_MASK    ((uint32_t) 0x0000001FUL)
#define MPU_RASR1_SIZE_32B    ((uint32_t) 0x00000004UL)
#define MPU_RASR1_SIZE_1KB    ((uint32_t) 0x00000009UL)
#define MPU_RASR1_SIZE_1MB    ((uint32_t) 0x00000013UL)
#define MPU_RASR1_SIZE_1GB    ((uint32_t) 0x0000001DUL)
#define MPU_RASR1_SIZE_4GB    ((uint32_t) 0x0000001FUL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD0_MASK    ((uint32_t) 0x00000100UL)
#define MPU_RASR1_R_SRD0_BIT    (8UL)
#define MPU_RASR1_R_SRD0_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD0_DIS    ((uint32_t) 0x00000100UL)

#define MPU_RASR1_SRD0_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD0_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD0_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD1_MASK    ((uint32_t) 0x00000200UL)
#define MPU_RASR1_R_SRD1_BIT    (9UL)
#define MPU_RASR1_R_SRD1_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD1_DIS    ((uint32_t) 0x00000200UL)

#define MPU_RASR1_SRD1_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD1_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD1_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD2_MASK    ((uint32_t) 0x00000400UL)
#define MPU_RASR1_R_SRD2_BIT    (10UL)
#define MPU_RASR1_R_SRD2_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD2_DIS    ((uint32_t) 0x00000400UL)

#define MPU_RASR1_SRD2_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD2_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD2_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD3_MASK    ((uint32_t) 0x00000800UL)
#define MPU_RASR1_R_SRD3_BIT    (11UL)
#define MPU_RASR1_R_SRD3_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD3_DIS    ((uint32_t) 0x00000800UL)

#define MPU_RASR1_SRD3_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD3_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD3_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD4_MASK    ((uint32_t) 0x00001000UL)
#define MPU_RASR1_R_SRD4_BIT    (12UL)
#define MPU_RASR1_R_SRD4_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD4_DIS    ((uint32_t) 0x00001000UL)

#define MPU_RASR1_SRD4_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD4_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD4_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD5_MASK    ((uint32_t) 0x00002000UL)
#define MPU_RASR1_R_SRD5_BIT    (13UL)
#define MPU_RASR1_R_SRD5_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD5_DIS    ((uint32_t) 0x00002000UL)

#define MPU_RASR1_SRD5_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD5_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD5_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD6_MASK    ((uint32_t) 0x00004000UL)
#define MPU_RASR1_R_SRD6_BIT    (14UL)
#define MPU_RASR1_R_SRD6_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD6_DIS    ((uint32_t) 0x00004000UL)

