InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/MPU/Peripheral/Register/xHeader/MPU_RegisterDefines.h
#define MPU_RASR1_SRD6_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD6_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD6_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_SRD7_MASK    ((uint32_t) 0x00008000UL)
#define MPU_RASR1_R_SRD7_BIT    (15UL)
#define MPU_RASR1_R_SRD7_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_SRD7_DIS    ((uint32_t) 0x00008000UL)

#define MPU_RASR1_SRD7_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_SRD7_ENA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_SRD7_DIS    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_B_MASK    ((uint32_t) 0x00010000UL)
#define MPU_RASR1_R_B_BIT    (16UL)
#define MPU_RASR1_R_B_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_B_ENA    ((uint32_t) 0x00010000UL)

#define MPU_RASR1_B_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_B_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_B_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_C_MASK    ((uint32_t) 0x00020000UL)
#define MPU_RASR1_R_C_BIT    (17UL)
#define MPU_RASR1_R_C_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_C_ENA    ((uint32_t) 0x00020000UL)

#define MPU_RASR1_C_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_C_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_C_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_S_MASK    ((uint32_t) 0x00040000UL)
#define MPU_RASR1_R_S_BIT    (18UL)
#define MPU_RASR1_R_S_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_S_ENA    ((uint32_t) 0x00040000UL)

#define MPU_RASR1_S_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_S_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_S_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_TEX_MASK    ((uint32_t) 0x00380000UL)
#define MPU_RASR1_R_TEX_BIT    (19UL)
#define MPU_RASR1_R_TEX_NC    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_TEX_WB_WRA    ((uint32_t) 0x00080000UL)
#define MPU_RASR1_R_TEX_WT_NWA    ((uint32_t) 0x00100000UL)
#define MPU_RASR1_R_TEX_WB_NWA    ((uint32_t) 0x00180000UL)

#define MPU_RASR1_TEX_MASK    ((uint32_t) 0x00000007UL)
#define MPU_RASR1_TEX_NC    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_TEX_WB_WRA    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_TEX_WT_NWA    ((uint32_t) 0x00000002UL)
#define MPU_RASR1_TEX_WB_NWA    ((uint32_t) 0x00000003UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_AP_MASK    ((uint32_t) 0x07000000UL)
#define MPU_RASR1_R_AP_BIT    (24UL)
#define MPU_RASR1_R_AP_NANA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_AP_RWNA    ((uint32_t) 0x01000000UL)
#define MPU_RASR1_R_AP_RWRO    ((uint32_t) 0x02000000UL)
#define MPU_RASR1_R_AP_RWRW    ((uint32_t) 0x03000000UL)
#define MPU_RASR1_R_AP_RONA    ((uint32_t) 0x05000000UL)
#define MPU_RASR1_R_AP_RORO    ((uint32_t) 0x06000000UL)

#define MPU_RASR1_AP_MASK    ((uint32_t) 0x00000007UL)
#define MPU_RASR1_AP_NANA    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_AP_RWNA    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_AP_RWRO    ((uint32_t) 0x00000002UL)
#define MPU_RASR1_AP_RWRW    ((uint32_t) 0x00000003UL)
#define MPU_RASR1_AP_RONA    ((uint32_t) 0x00000005UL)
#define MPU_RASR1_AP_RORO    ((uint32_t) 0x00000006UL)
/*--------*/

/*--------*/
#define MPU_RASR1_R_XN_MASK    ((uint32_t) 0x10000000UL)
#define MPU_RASR1_R_XN_BIT    (28UL)
#define MPU_RASR1_R_XN_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_R_XN_ENA    ((uint32_t) 0x10000000UL)

#define MPU_RASR1_XN_MASK    ((uint32_t) 0x00000001UL)
#define MPU_RASR1_XN_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RASR1_XN_ENA    ((uint32_t) 0x00000001UL)
/*--------*/

/**********************************************************************************************
**************************************8 RBAR2 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RBAR2_R_REGION_MASK    ((uint32_t) 0x0000000FUL)
#define MPU_RBAR2_R_REGION_BIT    (0UL)
#define MPU_RBAR2_R_REGION_REG0    ((uint32_t) 0x00000000UL)
#define MPU_RBAR2_R_REGION_REG1    ((uint32_t) 0x00000001UL)
#define MPU_RBAR2_R_REGION_REG2    ((uint32_t) 0x00000002UL)
#define MPU_RBAR2_R_REGION_REG3    ((uint32_t) 0x00000003UL)
#define MPU_RBAR2_R_REGION_REG4    ((uint32_t) 0x00000004UL)
#define MPU_RBAR2_R_REGION_REG5    ((uint32_t) 0x00000005UL)
#define MPU_RBAR2_R_REGION_REG6    ((uint32_t) 0x00000006UL)
#define MPU_RBAR2_R_REGION_REG7    ((uint32_t) 0x00000007UL)
#define MPU_RBAR2_R_REGION_REG8    ((uint32_t) 0x00000008UL)
#define MPU_RBAR2_R_REGION_REG9    ((uint32_t) 0x00000009UL)
#define MPU_RBAR2_R_REGION_REG10    ((uint32_t) 0x0000000AUL)
#define MPU_RBAR2_R_REGION_REG11    ((uint32_t) 0x0000000BUL)
#define MPU_RBAR2_R_REGION_REG12    ((uint32_t) 0x0000000CUL)
#define MPU_RBAR2_R_REGION_REG13    ((uint32_t) 0x0000000DUL)
#define MPU_RBAR2_R_REGION_REG14    ((uint32_t) 0x0000000EUL)
#define MPU_RBAR2_R_REGION_REG15    ((uint32_t) 0x0000000FUL)

#define MPU_RBAR2_REGION_MASK    ((uint32_t) 0x0000000FUL)
#define MPU_RBAR2_REGION_REG0    ((uint32_t) 0x00000000UL)
#define MPU_RBAR2_REGION_REG1    ((uint32_t) 0x00000001UL)
#define MPU_RBAR2_REGION_REG2    ((uint32_t) 0x00000002UL)
#define MPU_RBAR2_REGION_REG3    ((uint32_t) 0x00000003UL)
#define MPU_RBAR2_REGION_REG4    ((uint32_t) 0x00000004UL)
#define MPU_RBAR2_REGION_REG5    ((uint32_t) 0x00000005UL)
#define MPU_RBAR2_REGION_REG6    ((uint32_t) 0x00000006UL)
#define MPU_RBAR2_REGION_REG7    ((uint32_t) 0x00000007UL)
#define MPU_RBAR2_REGION_REG8    ((uint32_t) 0x00000008UL)
#define MPU_RBAR2_REGION_REG9    ((uint32_t) 0x00000009UL)
#define MPU_RBAR2_REGION_REG10    ((uint32_t) 0x0000000AUL)
#define MPU_RBAR2_REGION_REG11    ((uint32_t) 0x0000000BUL)
#define MPU_RBAR2_REGION_REG12    ((uint32_t) 0x0000000CUL)
#define MPU_RBAR2_REGION_REG13    ((uint32_t) 0x0000000DUL)
#define MPU_RBAR2_REGION_REG14    ((uint32_t) 0x0000000EUL)
#define MPU_RBAR2_REGION_REG15    ((uint32_t) 0x0000000FUL)
/*--------*/

/*--------*/
#define MPU_RBAR2_R_VALID_MASK    ((uint32_t) 0x00000010UL)
#define MPU_RBAR2_R_VALID_BIT    (4UL)
#define MPU_RBAR2_R_VALID_DIS    ((uint32_t) 0x00000000UL)
#define MPU_RBAR2_R_VALID_ENA    ((uint32_t) 0x00000010UL)

